Revit 2027 API
ViewSheetSet.OrderedViewList Property
 Ordered views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IReadOnlyList<View> OrderedViewList { get; set; }
Public Overridable Property OrderedViewList As IReadOnlyList(Of View)
	Get
	Set
public:
virtual property IReadOnlyList<View^>^ OrderedViewList {
	IReadOnlyList<View^>^ get ();
	void set (IReadOnlyList<View^>^ value);
}
abstract OrderedViewList : IReadOnlyList<View> with get, set
override OrderedViewList : IReadOnlyList<View> with get, set
Property Value
IReadOnlyList<View>
Implements
IViewSheetSet.OrderedViewList
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input ordered view list is null.
InvalidOperationException |  Thrown when the set operation failed due to invalid view which cannot be printed.
See Also
Reference
ViewSheetSet Class
Autodesk.Revit.DB Namespace